vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT595S_DFP.pdsc
    <condition id="anyOf.allOf=board=evkmimxrt595, component.flexspi_nor_flash_adapter_rt595evk.internal_condition">
      <accept condition="allOf.board=evkmimxrt595, component.flexspi_nor_flash_adapter_rt595evk.internal_condition"/>
    </condition>
    <condition id="allOf.board=evkmimxrt595, component.flexspi_nor_flash_adapter_rt595evk.internal_condition">
      <require condition="board.evkmimxrt595.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="adapter_rt595evk"/>
    </condition>
    <condition id="component.flash_nand_flexspi.condition_id">
      <require condition="allOf.driver.flexspi, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexspi, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="component.flash_nor_flexspi.condition_id">
      <require condition="allOf.driver.flexspi, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="component.flexcomm_i2c_adapter.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, driver.flexcomm_i2c, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, driver.flexcomm_i2c, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="component.flexcomm_spi_adapter.condition_id">
      <require condition="allOf.driver.common, driver.flexcomm_spi, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.flexcomm_spi, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="component.flexspi_nor_flash_adapter_rt595evk.condition_id">
      <require condition="allOf.board=evkmimxrt595, driver.flexspi, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.board=evkmimxrt595, driver.flexspi, device=MIMXRT595S.internal_condition">
      <require condition="board.evkmimxrt595.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="component.i2c_adapter_interface.condition_id">
      <require condition="allOf.anyOf=allOf=component.flexcomm_i2c_adapter, driver.flexcomm_i2c, allOf=component.i3c_adapter, driver.i3c, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.flexcomm_i2c_adapter, driver.flexcomm_i2c, allOf=component.i3c_adapter, driver.i3c, device=MIMXRT595S.internal_condition">
      <require condition="anyOf.allOf=component.flexcomm_i2c_adapter, driver.flexcomm_i2c, allOf=component.i3c_adapter, driver.i3c.internal_condition"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.flexcomm_i2c_adapter, driver.flexcomm_i2c, allOf=component.i3c_adapter, driver.i3c.internal_condition">
      <accept condition="allOf.component.flexcomm_i2c_adapter, driver.flexcomm_i2c.internal_condition"/>
      <accept condition="allOf.component.i3c_adapter, driver.i3c.internal_condition"/>
    </condition>
    <condition id="allOf.component.flexcomm_i2c_adapter, driver.flexcomm_i2c.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_i2c_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="allOf.component.i3c_adapter, driver.i3c.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
    </condition>
    <condition id="component.i2c_mux.condition_id">
      <require condition="allOf.device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="component.i2c_mux_pca954x.condition_id">
      <require condition="allOf.component.i2c_mux, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_mux, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="component.i3c_adapter.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, driver.i3c, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, driver.i3c, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="component.i3c_bus.condition_id">
      <require condition="allOf.component.lists, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.component.lists, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="component.i3c_bus_adapter.condition_id">
      <require condition="allOf.component.i3c_bus, driver.i3c, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.component.i3c_bus, driver.i3c, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c_bus"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="component.led.condition_id">
      <require condition="allOf.anyOf=allOf=component.lpc_gpio_adapter, driver.lpc_gpio, component.timer_manager, driver.common, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.lpc_gpio_adapter, driver.lpc_gpio, component.timer_manager, driver.common, device=MIMXRT595S.internal_condition">
      <require condition="anyOf.allOf=component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition">
      <accept condition="allOf.component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_gpio_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
    </condition>
    <condition id="component.lists.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="component.log.condition_id">
      <require condition="allOf.driver.common, utility.str, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.str, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debug_console.condition_id">
      <require condition="allOf.component.log, driver.common, utility.debug_console, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, utility.debug_console, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debug_console_lite.condition_id">
      <require condition="allOf.component.log, driver.common, utility.debug_console_lite, device=MIMXRT595S.internal_condition"/>
    </condition>
