vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT595S_DFP.pdsc
    <condition id="driver.camera-receiver-common.condition_id">
      <require condition="allOf.driver.camera-common, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.casper.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_flexcomm_i2c.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device.RTE, driver.flexcomm_i2c_dma, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device.RTE, driver.flexcomm_i2c_dma, device=MIMXRT595S.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_flexcomm_spi.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.SPI, device.RTE, driver.flexcomm_spi_dma, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.SPI, device.RTE, driver.flexcomm_spi_dma, device=MIMXRT595S.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_flexcomm_usart.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.USART, device.RTE, driver.flexcomm_usart_dma, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.USART, device.RTE, driver.flexcomm_usart_dma, device_id=MIMXRT595S.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma"/>
      <require condition="device_id.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.codec.condition_id">
      <require condition="allOf.device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm33.condition_id">
      <require condition="cores.cm33.internal_condition"/>
    </condition>
    <condition id="driver.cs42448.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.cs42448_adapter, driver.codec, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.cs42448_adapter, driver.codec, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42448_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.cs42888.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.cs42888_adapter, driver.codec, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.cs42888_adapter, driver.codec, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.ctimer.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.dbi.condition_id">
      <require condition="allOf.driver.video-common, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.dbi_flexio_smartdma.condition_id">
      <require condition="allOf.driver.dbi, driver.flexio_mculcd, driver.flexio_mculcd_smartdma, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dbi, driver.flexio_mculcd, driver.flexio_mculcd_smartdma, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd_smartdma"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.dbi_lcdif.condition_id">
      <require condition="allOf.driver.dbi, driver.lcdif, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dbi, driver.lcdif, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lcdif"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.dbi_lpc_spi_dma.condition_id">
      <require condition="allOf.driver.dbi, driver.flexcomm_spi_dma, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dbi, driver.flexcomm_spi_dma, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-common.condition_id">
      <require condition="allOf.driver.video-common, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-dbi.condition_id">
      <require condition="allOf.driver.common, driver.dbi, driver.dc-fb-common, driver.display-common, device=MIMXRT595S.internal_condition"/>
    </condition>
