vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT595S_DFP.pdsc
    <condition id="allOf.driver.common, driver.dbi, driver.dc-fb-common, driver.display-common, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-dsi-cmd.condition_id">
      <require condition="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-mipi-dsi-cmd"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-lcdif.condition_id">
      <require condition="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.lcdif, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.lcdif, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lcdif"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-ssd1963.condition_id">
      <require condition="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.ssd1963, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.ssd1963, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ssd1963"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.dialog7212.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.da7212_adapter, driver.codec, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.da7212_adapter, driver.codec, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.display-adv7535.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.display-common, driver.video-i2c, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-i2c"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.display-co5300.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-mipi-dsi-cmd"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.display-common.condition_id">
      <require condition="allOf.driver.video-common, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.display-hx8394.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.display-it6161.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.display-it6263.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.display-mipi-dsi-cmd.condition_id">
      <require condition="allOf.anyOf=driver.mipi_dsi, driver.common, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.mipi_dsi, driver.common, device=MIMXRT595S.internal_condition">
      <require condition="anyOf.driver.mipi_dsi.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.mipi_dsi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mipi_dsi"/>
    </condition>
    <condition id="driver.display-rm67162.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT595S.internal_condition"/>
    </condition>
