vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT595S_DFP.pdsc
    <condition id="driver.display-rm67191.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.display-rm68191.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.display-rm68200.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.display-rm692c9.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.display-rpi.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.display-sn65dsi83.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.dmic.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.dmic_dma.condition_id">
      <require condition="allOf.driver.dmic, driver.lpc_dma, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dmic, driver.lpc_dma, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmic"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.dmic_hwvad.condition_id">
      <require condition="allOf.driver.dmic, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dmic, device_id=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmic"/>
      <require condition="device_id.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.dsp.condition_id">
      <require condition="allOf.core=cm33, device_id=MIMXRT595S, driver.power.internal_condition"/>
    </condition>
    <condition id="allOf.core=cm33, device_id=MIMXRT595S, driver.power.internal_condition">
      <require condition="core.cm33.internal_condition"/>
      <require condition="device_id.MIMXRT595S.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
    </condition>
    <condition id="core.cm33.internal_condition">
      <accept Dcore="Cortex-M33"/>
    </condition>
    <condition id="driver.ektf2k.condition_id">
      <require condition="allOf.device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_i2c.condition_id">
      <require condition="allOf.driver.common, driver.flexcomm, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.flexcomm, device_id=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require condition="device_id.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_i2c_dma.condition_id">
      <require condition="allOf.driver.flexcomm_i2c, driver.lpc_dma, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm_i2c, driver.lpc_dma, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_i2s.condition_id">
      <require condition="allOf.driver.common, driver.flexcomm, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_i2s_dma.condition_id">
      <require condition="allOf.driver.flexcomm_i2s, driver.lpc_dma, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm_i2s, driver.lpc_dma, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2s"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_spi.condition_id">
      <require condition="allOf.driver.common, driver.flexcomm, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_spi_dma.condition_id">
      <require condition="allOf.driver.flexcomm_spi, driver.lpc_dma, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm_spi, driver.lpc_dma, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_usart.condition_id">
      <require condition="allOf.driver.flexcomm, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm, device_id=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require condition="device_id.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_usart_dma.condition_id">
      <require condition="allOf.driver.flexcomm_usart, driver.lpc_dma, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm_usart, driver.lpc_dma, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.flexio.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2c_master.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device_id=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device_id.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT595S.internal_condition"/>
    </condition>
