vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT595S_DFP.pdsc
    <condition id="driver.lsm6dso.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.max30101.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.memory.condition_id">
      <require condition="allOf.core=cm33, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.core=cm33, device_id=MIMXRT595S.internal_condition">
      <require condition="core.cm33.internal_condition"/>
      <require condition="device_id.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.mipi_dsi.condition_id">
      <require condition="allOf.driver.common, driver.mipi_dsi_soc, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.mipi_dsi_soc, device_id=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="soc_mipi_dsi"/>
      <require condition="device_id.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.mipi_dsi_smartdma.condition_id">
      <require condition="allOf.driver.mipi_dsi, driver.smartdma, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.mipi_dsi, driver.smartdma, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mipi_dsi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smartdma"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.mipi_dsi_soc.condition_id">
      <require condition="allOf.device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.mrt.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.mu.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.nmh1000.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.ostimer.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.otfad.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.p3t1755.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.pca9420.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, driver.power, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.flexcomm_i2c, driver.common, driver.power, device=MIMXRT595S.internal_condition">
      <require condition="anyOf.driver.flexcomm_i2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.pca9422.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, driver.power, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.pcm186x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.pcm512x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MIMXRT595S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.pf5020.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.pint.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="driver.power.condition_id">
      <require condition="allOf.core=cm33, device_id=MIMXRT595S.internal_condition"/>
    </condition>
