vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT595S_DFP.pdsc
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MIMXRT595S" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MIMXRT595S</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT595S/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT595S/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT595S/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT595S/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT595S/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT595S/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT595S/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT595S/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT595S/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MIMXRT595S_startup</description>
      <files>
        <file condition="allOf.toolchains=iar, core_ids=cm33.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT595S/iar/startup_MIMXRT595S_cm33.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc, core_ids=cm33.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT595S/gcc/startup_MIMXRT595S_cm33.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk, core_ids=cm33.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT595S/arm/startup_MIMXRT595S_cm33.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT595S_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MIMXRT595S_system</description>
      <files>
        <file condition="allOf.core_ids=cm33.condition_id" category="sourceC" name="devices/MIMXRT595S/system_MIMXRT595S_cm33.c" projectpath="device"/>
        <file condition="allOf.core_ids=cm33.condition_id" category="header" name="devices/MIMXRT595S/system_MIMXRT595S_cm33.h" projectpath="device"/>
        <file category="include" name="devices/MIMXRT595S/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="acmp" Cversion="2.3.0" condition="driver.acmp.condition_id">
      <description>ACMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT595S/drivers/fsl_acmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT595S/drivers/fsl_acmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT595S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_cache64" Cversion="2.0.11" condition="driver.cache_cache64.condition_id">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT595S/drivers/fsl_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT595S/drivers/fsl_cache.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT595S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common" Cversion="1.0.0" condition="driver.camera-common.condition_id">
      <description>Driver camera-common</description>
      <files>
        <file category="header" name="components/video/camera/fsl_camera.h" projectpath="video"/>
        <file category="include" name="components/video/camera/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ap1302" Cversion="1.0.1" condition="driver.camera-device-ap1302.condition_id">
      <description>Driver camera-device-ap1302</description>
      <files>
        <file category="header" name="components/video/camera/device/ap1302/fsl_ap1302.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ap1302/fsl_ap1302.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ap1302/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common" Cversion="1.0.0" condition="driver.camera-device-common.condition_id">
      <description>Driver camera-device-common</description>
      <files>
        <file category="header" name="components/video/camera/device/fsl_camera_device.h" projectpath="video"/>
        <file category="include" name="components/video/camera/device/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-max9286" Cversion="1.0.2" condition="driver.camera-device-max9286.condition_id">
      <description>Driver camera-device-max9286</description>
      <files>
        <file category="header" name="components/video/camera/device/max9286/fsl_max9286.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/max9286/fsl_max9286.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/max9286/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-mt9m114" Cversion="1.0.2" condition="driver.camera-device-mt9m114.condition_id">
      <description>Driver camera-device-mt9m114</description>
      <files>
        <file category="header" name="components/video/camera/device/mt9m114/fsl_mt9m114.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/mt9m114/fsl_mt9m114.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/mt9m114/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov5640" Cversion="1.0.1" condition="driver.camera-device-ov5640.condition_id">
      <description>Driver camera-device-ov5640</description>
      <files>
        <file category="header" name="components/video/camera/device/ov5640/fsl_ov5640.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov5640/fsl_ov5640.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov5640/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov7670" Cversion="1.0.2" condition="driver.camera-device-ov7670.condition_id">
      <description>Driver camera-device-ov7670</description>
      <files>
        <file category="header" name="components/video/camera/device/ov7670/fsl_ov7670.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov7670/fsl_ov7670.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov7670/"/>
      </files>
    </component>
