vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT595S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer" Cversion="2.3.3" condition="driver.ctimer.condition_id">
      <description>CTimer Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT595S/drivers/fsl_ctimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT595S/drivers/fsl_ctimer.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT595S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dbi" Cversion="1.0.0" condition="driver.dbi.condition_id">
      <description>Driver dbi</description>
      <files>
        <file category="header" name="components/video/display/dbi/fsl_dbi.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dbi/fsl_dbi.c" projectpath="video"/>
        <file category="include" name="components/video/display/dbi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dbi_flexio_smartdma" Cversion="1.0.1" condition="driver.dbi_flexio_smartdma.condition_id">
      <description>Driver dbi_flexio_smartdma</description>
      <files>
        <file category="header" name="components/video/display/dbi/flexio/fsl_dbi_flexio_smartdma.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dbi/flexio/fsl_dbi_flexio_smartdma.c" projectpath="video"/>
        <file category="include" name="components/video/display/dbi/flexio/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dbi_lcdif" Cversion="1.0.1" condition="driver.dbi_lcdif.condition_id">
      <description>Driver dbi_lcdif</description>
      <files>
        <file category="header" name="components/video/display/dbi/lcdif/fsl_dbi_lcdif.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dbi/lcdif/fsl_dbi_lcdif.c" projectpath="video"/>
        <file category="include" name="components/video/display/dbi/lcdif/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dbi_lpc_spi_dma" Cversion="1.0.0" condition="driver.dbi_lpc_spi_dma.condition_id">
      <description>Driver dbi_lpc_spi_dma</description>
      <files>
        <file category="header" name="components/video/display/dbi/lpc_spi/fsl_dbi_spi_dma.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dbi/lpc_spi/fsl_dbi_spi_dma.c" projectpath="video"/>
        <file category="include" name="components/video/display/dbi/lpc_spi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common" Cversion="1.0.0" condition="driver.dc-fb-common.condition_id">
      <description>Driver dc-fb-common</description>
      <files>
        <file category="header" name="components/video/display/dc/fsl_dc_fb.h" projectpath="video"/>
        <file category="include" name="components/video/display/dc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-dbi" Cversion="1.0.0" condition="driver.dc-fb-dbi.condition_id">
      <description>Driver dc-fb-dbi</description>
      <RTE_Components_h>
#ifndef MCUX_DBI_LEGACY
#define MCUX_DBI_LEGACY 0
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/video/display/dc/dbi/fsl_dc_fb_dbi.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dc/dbi/fsl_dc_fb_dbi.c" projectpath="video"/>
        <file category="include" name="components/video/display/dc/dbi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-dsi-cmd" Cversion="1.1.1" condition="driver.dc-fb-dsi-cmd.condition_id">
      <description>Driver dc-fb-dsi-cmd</description>
      <files>
        <file category="header" name="components/video/display/dc/dsi_cmd/fsl_dc_fb_dsi_cmd.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dc/dsi_cmd/fsl_dc_fb_dsi_cmd.c" projectpath="video"/>
        <file category="include" name="components/video/display/dc/dsi_cmd/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-lcdif" Cversion="1.0.1" condition="driver.dc-fb-lcdif.condition_id">
      <description>Driver dc-fb-lcdif</description>
      <files>
        <file category="header" name="components/video/display/dc/lcdif/fsl_dc_fb_lcdif.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dc/lcdif/fsl_dc_fb_lcdif.c" projectpath="video"/>
        <file category="include" name="components/video/display/dc/lcdif/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-ssd1963" Cversion="1.0.2" condition="driver.dc-fb-ssd1963.condition_id">
      <description>Driver dc-fb-ssd1963</description>
      <files>
        <file category="header" name="components/video/display/dc/ssd1963/fsl_dc_fb_ssd1963.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dc/ssd1963/fsl_dc_fb_ssd1963.c" projectpath="video"/>
        <file category="include" name="components/video/display/dc/ssd1963/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dialog7212" Cversion="2.3.1" condition="driver.dialog7212.condition_id">
      <description>Driver dialog7212</description>
      <RTE_Components_h>
#ifndef CODEC_DA7212_ENABLE
#define CODEC_DA7212_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/da7212/fsl_dialog7212.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/da7212/fsl_dialog7212.c" projectpath="codec"/>
        <file category="include" name="components/codec/da7212/"/>
      </files>
    </component>
