vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT595S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="power" Cversion="2.6.1" condition="driver.power.condition_id">
      <description>Power driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT595S/drivers/fsl_power.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT595S/drivers/fsl_power.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT595S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="powerquad" Cversion="2.2.0" condition="driver.powerquad.condition_id">
      <description>POWERQUAD Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT595S/drivers/fsl_powerquad_data.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT595S/drivers/fsl_powerquad_data.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT595S/drivers/fsl_powerquad.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT595S/drivers/fsl_powerquad_basic.c" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT595S/drivers/fsl_powerquad_math.c" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT595S/drivers/fsl_powerquad_matrix.c" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT595S/drivers/fsl_powerquad_filter.c" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT595S/drivers/fsl_powerquad_transform.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT595S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="psp27801" Cversion="1.0.0" condition="driver.psp27801.condition_id">
      <description>Driver psp27801</description>
      <files>
        <file category="header" name="components/display/psp27801/fsl_psp27801.h" projectpath="oled"/>
        <file category="sourceC" name="components/display/psp27801/fsl_psp27801.c" projectpath="oled"/>
        <file category="include" name="components/display/psp27801/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="PUF" Cversion="2.2.0" condition="driver.puf.condition_id">
      <description>PUF Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT595S/drivers/fsl_puf.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT595S/drivers/fsl_puf.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT595S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset" Cversion="2.1.0" condition="driver.reset.condition_id">
      <description>Reset Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT595S/drivers/fsl_reset.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT595S/drivers/fsl_reset.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT595S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sctimer" Cversion="2.5.1" condition="driver.sctimer.condition_id">
      <description>SCT Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT595S/drivers/fsl_sctimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT595S/drivers/fsl_sctimer.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT595S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sema42" Cversion="2.1.1" condition="driver.sema42.condition_id">
      <description>SEMA42 Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT595S/drivers/fsl_sema42.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT595S/drivers/fsl_sema42.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT595S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl5000" Cversion="2.1.1" condition="driver.sgtl5000.condition_id">
      <description>Driver sgtl5000</description>
      <RTE_Components_h>
#ifndef CODEC_SGTL5000_ENABLE
#define CODEC_SGTL5000_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/sgtl5000/fsl_sgtl5000.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/sgtl5000/fsl_sgtl5000.c" projectpath="codec"/>
        <file category="include" name="components/codec/sgtl5000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smartdma" Cversion="2.13.2" condition="driver.smartdma.condition_id">
      <description>SMARTDMA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT595S/drivers/fsl_smartdma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT595S/drivers/fsl_smartdma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT595S/drivers/fsl_smartdma_prv.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT595S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smartdma_rt500" Cversion="2.12.0" condition="driver.smartdma_rt500.condition_id">
      <description>SMARTDMA Driver for RT500</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT595S/drivers/fsl_smartdma_rt500.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT595S/drivers/fsl_smartdma_rt500.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT595S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ssd1963" Cversion="1.2.0" condition="driver.ssd1963.condition_id">
      <description>Driver ssd1963</description>
      <files>
        <file category="header" name="components/display/ssd1963/fsl_ssd1963.h" projectpath="lcdc"/>
        <file category="sourceC" name="components/display/ssd1963/fsl_ssd1963.c" projectpath="lcdc"/>
        <file category="include" name="components/display/ssd1963/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="st7796s" Cversion="1.0.0" condition="driver.st7796s.condition_id">
      <description>Driver st7796s</description>
      <files>
        <file category="header" name="components/display/st7796s/fsl_st7796s.h" projectpath="lcdc"/>
        <file category="sourceC" name="components/display/st7796s/fsl_st7796s.c" projectpath="lcdc"/>
        <file category="include" name="components/display/st7796s/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9896" Cversion="6.0.2" condition="driver.tfa9896.condition_id">
      <description>Driver tfa9896</description>
      <RTE_Components_h>
#ifndef CODEC_TFA9896_ENABLE
#define CODEC_TFA9896_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/tfa9896/fsl_tfa9896_buffer.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/tfa9896/fsl_hal_registers.c" projectpath="codec"/>
        <file category="sourceC" name="components/codec/tfa9896/fsl_tfa9896.c" projectpath="codec"/>
        <file category="header" name="components/codec/tfa9896/fsl_tfa9896.h" projectpath="codec"/>
        <file category="doc" name="components/codec/tfa9896/MIMXRT595595-EVK_TFA9896_SW.pdf" projectpath="codec"/>
        <file category="include" name="components/codec/tfa9896/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx" Cversion="2.1.0" condition="driver.tfa9xxx.condition_id">
      <description>Driver tfa9xxx</description>
      <RTE_Components_h>
#ifndef CODEC_TFA9XXX_ENABLE
#define CODEC_TFA9XXX_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/tfa9xxx/tfa_config_TFA9892N1.h" projectpath="codec/tfa9xxx"/>
        <file category="header" name="components/codec/tfa9xxx/tfa_config_TFA9894N1.h" projectpath="codec/tfa9xxx"/>
        <file category="header" name="components/codec/tfa9xxx/tfa_config_TFA9894N2.h" projectpath="codec/tfa9xxx"/>
        <file category="sourceC" name="components/codec/tfa9xxx/fsl_tfa9xxx.c" projectpath="codec/tfa9xxx"/>
        <file category="header" name="components/codec/tfa9xxx/fsl_tfa9xxx.h" projectpath="codec/tfa9xxx"/>
        <file category="sourceC" name="components/codec/tfa9xxx/fsl_tfa9xxx_IMX.c" projectpath="codec/tfa9xxx"/>
        <file category="doc" name="components/codec/tfa9xxx/README.md" projectpath="codec/tfa9xxx"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/config.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="sourceC" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_container.c" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_container.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="sourceC" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_dev.c" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_dev.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_dsp_fw.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="sourceC" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_haptic.c" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_haptic.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="sourceC" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_init.c" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa9xxx_parameters.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="sourceC" name="components/codec/tfa9xxx/vas_tfa_drv/tfa_container_crc32.c" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa_haptic_fw_defs.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="include" name="components/codec/tfa9xxx/"/>
        <file category="include" name="components/codec/tfa9xxx/vas_tfa_drv/"/>
      </files>
    </component>
